package chapter11;

/**
 * 1.3 LinkedList
 */
public class Chapter11_3 {

    /**
     * 배열은 가장 기본적인 형태의 자료구조로 구조가 간단하며 사용하기 쉽고 데이터를 일거오는데 걸리는 시간(접근시간, access time)이 가장 빠
     * 르다는 장점을 가지고 있지만 다음과 같은 단점을 가지고 있다.
     * 1. 크기를 변경할 수 없다.
     * - 크기를 변경할 수 없으므로 새로운 배열을 생성해서 데이터를 복사해야한다.
     * - 실행속도를 향상시키기 위해서는 충분히 큰 크기의 배열을 생성해야 하므로 메모리가 낭비된다.
     * 2. 비순차적인 데이터의 추가 또는 삭제에 시간이 많이 걸린다.
     * - 차례대로 데이터를 추가하고 마지막에서부터 데이터를 삭제하는 것은 빠르지만,
     * - 배열의 중간에 데이터를 추가하려면, 빈자리를 만들기 위해 다른 데이터들을 복사해서 이동해야한다.
     * 이러한 배열의 단점을 보완하기 위해서 링크드 리스트(linked list)라는 자료구조가 고안되었다. 배열은 모든 데이터가 연속적으로 존재하지만
     * 링크드 리스트는 불연속적으로 존재하는 데이터를 서로 연결(link)한 형태로 구성되어있다.
     */

}
