package chapter15;

/**
 * <h1>1. 자바에서의 입출력</h1>
 */
public class Chapter15 {

	/**
	 * <h5>1.1 입출력이란?</h5><br>
	 * I/O란 Input과 Output의 약자로 입력과 출력, 간단히 줄여서 입출력이라고 한다. 입출력은 컴퓨터 내부 또는 외부의 장치와 프로그램간의 데이터를 주고받는 것을 말한다.
	 */
	class Memo1 {

	}

	/**
	 * <h5>1.2 스트림(stream)</h5><br>
	 * 자바에서 입출력을 수행하려면, 즉 어느 한쪽에서 다른 쪽으로 데이터를 전달하려면, 두 대상을 연결하고 데이터를 전송할 수 있는 무언가가 필요한데 이것을 스트림(stream)이라고 정의했다.<br>
	 * <b>스트림이란 데이터를 운반하는데 사용되는 연결통로이다.</b><br>
	 * 스트림은 연속적인 데이터의 흐름을 물에 비유해서 붙여진 이름인데, 여러 가지로 유사한 점이 많다. 물이 한쪽 방향으로만 흐르는 것과 같이 스트림은 단방향통신만 가능하기 때문에 하나의 스트림으로 입력과 출력을 동시에 처리할 수 없다.<br>
	 * 그래서 입력과 출력을 동시에 수행하려면 입력을 위한 입력스트림(input stream)과 출력을 위한 출력스트림(output stream), 모두 2개의 스트림이 필요하다.<br>
	 * 스트림은 먼저 보낸 데이터를 먼저 받게 되어 있으면 중간에 건너뜀 없이 연속적으로 데이터를 주고받는다.
	 */
	class Memo2 {

	}

	/**
	 * <h5>1.3 바이트기반 스틤 - InputStream, OutputStream</h5><br>
	 */
	class Memo3 {

	}

}
